fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудник</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ВКМ_АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ДанныеГрафика) Тогда
	ПостроитьДиаграммуГанта(Параметры.ДанныеГрафика);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПостроитьДиаграммуГанта(ДанныеГрафика)
	ДиаграммаГанта.Очистить();
	
	ТЗДанныеГрафика = ПолучитьИзВременногоХранилища(ДанныеГрафика);
	Если НЕ ЗначениеЗаполнено(ТЗДанныеГрафика) Тогда
		Возврат;
	КонецЕсли;
	
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоГода(Объект.Год), КонецГода(Объект.Год));


	
	// Добавить  серию - план
	СерияПлан = ДиаграммаГанта.Серии.Добавить();
	СерияПлан.Текст = "План";
	СерияПлан.Цвет = WebЦвета.СинеФиолетовый;

	Для Каждого СтрокаТЧЗадачи Из ТЗДанныеГрафика Цикл

		Точка = ДиаграммаГанта.УстановитьТочку(СтрокаТЧЗадачи.ВКМ_Сотрудник); // Родитель= Групп
		Точка.Текст = Строка(СтрокаТЧЗадачи.ВКМ_Сотрудник);
		Точка.Картинка = БиблиотекаКартинок.Реквизит;
		ДиаграммаГанта.РазвернутьТочку(Точка, Ложь);
		
		// *****************************
		// Добавляем интервал серии план				

		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, СерияПлан);
		Значение.Редактирование = Истина;

		Интервал = Значение.Добавить();
		Интервал.Начало = СтрокаТЧЗадачи.ВКМ_ДатаНачала;
		Интервал.Конец = СтрокаТЧЗадачи.ВКМ_ДатаОкончания;
		Интервал.Текст = "Интервал план";

		УстановитьТекстЗначения(Значение.Текст, СтрокаТЧЗадачи.ВКМ_ДатаНачала, СтрокаТЧЗадачи.ВКМ_ДатаОкончания);
	КонецЦикла;
	// Фон, выделяем выходные	
	ТекущийПериод = НачалоМесяца(ДиаграммаГанта.НачалоПолногоИнтервала - 1);
	КонечныйПериода = ДиаграммаГанта.КонецПолногоИнтервала;

	Пока ТекущийПериод < КонечныйПериода Цикл
		Если КонецНедели(ТекущийПериод) = КонецДня(ТекущийПериод) Тогда
			ИнтервалФона = ДиаграммаГанта.ИнтервалыФона.Добавить(НачалоДня(ТекущийПериод - 86400), КонецДня(
				ТекущийПериод));
			ИнтервалФона.Цвет = WebЦвета.БледноЛиловый;
		КонецЕсли;

		ТекущийПериод = КонецДня(ТекущийПериод) + 1;
	КонецЦикла;

КонецПроцедуры
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекстЗначения(Текст, ДатаНачала, ДатаОкончания)
	Текст = СтрШаблон("%1%2%3", Строка(Текст), ?(ЗначениеЗаполнено(Текст), ";", ""), Формат(ДатаНачала, "ДЛФ=D;")
		+ " - " + Формат(ДатаОкончания, "ДЛФ=D;"));
КонецПроцедуры

#КонецОбласти
